app/controllers/invitations_controller.rb

INSERT INTO "invitations" ("tariff", "package", "surname", "name", "middlename", "sex", "citizenship", "birthDate", "arival_date", "departure_date", "passport", "visa_obtain_place", "cities", "hotels", "email", "promocode", "comments", "currency", "price", "accomodation", "meals", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23) RETURNING "id"
---
  def create
    # if submission_rate_limited?
    #   redirect_to root_path(tariff: params[:tariff].presence),
    #               notice: "We already received an application from your IP. Please try again in a couple of minutes."
    #   return
    # end

    @invitation = Invitation.new(invitation_params)

    popup = "submission_error"
    # Turnstile temporarily disabled; anti-spam is enforced via Redis rate-limit below.!
    is_dev = true || Rails.env.development?
    cf_verify = (is_dev || verify_turnstile(model: @invitation))
    if (is_dev || cf_verify.success?) && @invitation.save

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @invitation = Invitation.find(params[:id])